python/python-lib-numpy.org
#+TITLE: Numpy
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2018-10-26 Fri 11:04:00>
#+HTML_LINK_UP: ../readme.html
#+HTML_LINK_HOME: ../index.html
#+SETUPFILE: ~/.emacs.d/site-lisp/org-html-themes/setup/theme-readtheorg-local.setup
#+TAGS: python numpy tensorflow machine-learning data-processing

* Numpy
  Numpy 是 Python 科学计算的基础包，主要有以下一些功能：
  1. N 维数组
  2. 线性代数，傅里叶变换等

  #+BEGIN_SRC python :session cpython :exports both :results output pp
    import numpy as np
  #+END_SRC

  #+RESULTS:

* 基本用法
  Numpy 的数组类是 ~ndarray~ ，它的别名是 ~array~ 。主要 ~numpy.array~ 和 Python
  自带的 ~array.array~ 是不同的。

  | 属性         | 含义               |
  |--------------+--------------------|
  | arr.ndim     | 维度               |
  | arr.shape    | 每个维度的大小     |
  | arr.size     | 数组的所有元素个数 |
  | arr.dtype    | 元素的数据类型     |
  | arr.itemsize | 每个元素的字节数   |
  | arr.data     | 实际数据的引用     |

  #+BEGIN_SRC python :session cpython :exports both :results output pp
    a0 = np.arange(24).reshape((2, 3, 4))
    print(a0)
    print(a0.ndim)
    print(a0.shape)
    print(a0.size)
    print(a0.dtype)
    print(a0.itemsize)
    print(a0.data)
  #+END_SRC

  #+RESULTS:
  #+begin_example
  [[[ 0  1  2  3]
    [ 4  5  6  7]
    [ 8  9 10 11]]

   [[12 13 14 15]
    [16 17 18 19]
    [20 21 22 23]]]
  3
  (2, 3, 4)
  24
  int32
  4
  <memory at 0x0000021786B458B8>
  #+end_example

  Numpy 数组和普通数组的区别如下
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    a0 = [1, 2, 3]
    print(a0)
    print(type(a0))
    b0 = np.array([6, 7, 8])
    print(b0)
    print(type(b0))
  #+END_SRC

  #+RESULTS:
  : [1, 2, 3]
  : <class 'list'>
  : [6 7 8]
  : <class 'numpy.ndarray'>

* 创建数组
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    a1 = np.array([1, 2, 3, 4])
    a2 = np.array([(1.5, 2, 3), (4, 5, 6)])
    a3 = np.array([[1, 2], [3, 4]], dtype=complex)
    print(a1)
    print(a2)
    print(a3)
  #+END_SRC

  #+RESULTS:
  : [1 2 3 4]
  : [[1.5 2.  3. ]
  :  [4.  5.  6. ]]
  : [[1.+0.j 2.+0.j]
  :  [3.+0.j 4.+0.j]]

