python/python-lib-numpy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-12 Mon 20:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Numpy</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Numpy</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8bbc620">1. Numpy</a></li>
<li><a href="#orgcf043ba">2. 基本用法</a></li>
<li><a href="#orgf4b12a1">3. 创建数组</a></li>
<li><a href="#org18b8add">4. 初始化数组</a></li>
<li><a href="#org35d8d90">5. 拼接数组</a></li>
<li><a href="#org9b24287">6. 基本运算和矩阵相关算法</a></li>
<li><a href="#org99e75c6">7. 深度复制 copy 方法</a></li>
<li><a href="#org05e03cb">8. 索引</a>
<ul>
<li><a href="#orgf5b6ee8">8.1. 使用 Indices 索引</a></li>
<li><a href="#org3d1e6e0">8.2. 使用布尔值索引</a></li>
</ul>
</li>
<li><a href="#orge7524bc">9. 借助 matplotlib 画一些统计图</a></li>
<li><a href="#orgbd78fa4">10. 安装 Numpy 和测试</a></li>
<li><a href="#orgba6e611">11. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8bbc620" class="outline-2">
<h2 id="org8bbc620"><span class="section-number-2">1</span> Numpy</h2>
<div class="outline-text-2" id="text-1">
<p>
Numpy 是 Python 科学计算的基础包，主要有以下一些功能：
</p>
<ol class="org-ol">
<li>N 维数组</li>
<li>线性代数，傅里叶变换等</li>
</ol>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b9ca4a;">import</span> numpy <span style="color: #b9ca4a;">as</span> np
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf043ba" class="outline-2">
<h2 id="orgcf043ba"><span class="section-number-2">2</span> 基本用法</h2>
<div class="outline-text-2" id="text-2">
<p>
Numpy 的数组类是 <code>ndarray</code> ，它的别名是 <code>array</code> 。主要 <code>numpy.array</code> 和 Python
自带的 <code>array.array</code> 是不同的。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">属性</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">arr.ndim</td>
<td class="org-left">维度</td>
</tr>

<tr>
<td class="org-left">arr.shape</td>
<td class="org-left">每个维度的大小</td>
</tr>

<tr>
<td class="org-left">arr.size</td>
<td class="org-left">数组的所有元素个数</td>
</tr>

<tr>
<td class="org-left">arr.dtype</td>
<td class="org-left">元素的数据类型</td>
</tr>

<tr>
<td class="org-left">arr.itemsize</td>
<td class="org-left">每个元素的字节数</td>
</tr>

<tr>
<td class="org-left">arr.data</td>
<td class="org-left">实际数据的引用</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a0</span> = np.arange<span style="color: #8d5649;">(</span>24<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>2, 3, 4<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0.ndim<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0.shape<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0.size<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0.dtype<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0.itemsize<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0.data<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[[[ 0  1  2  3]
  [ 4  5  6  7]
  [ 8  9 10 11]]

 [[12 13 14 15]
  [16 17 18 19]
  [20 21 22 23]]]
3
(2, 3, 4)
24
int32
4
&lt;memory at 0x0000021786B458B8&gt;
</pre>

<p>
Numpy 数组和普通数组的区别如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a0</span> = <span style="color: #8d5649;">[</span>1, 2, 3<span style="color: #8d5649;">]</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span><span style="color: #c397d8;">type</span><span style="color: #d8241f;">(</span>a0<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">b0</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>6, 7, 8<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>b0<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span><span style="color: #c397d8;">type</span><span style="color: #d8241f;">(</span>b0<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[1, 2, 3]
&lt;class 'list'&gt;
[6 7 8]
&lt;class 'numpy.ndarray'&gt;

</pre>
</div>
</div>

<div id="outline-container-orgf4b12a1" class="outline-2">
<h2 id="orgf4b12a1"><span class="section-number-2">3</span> 创建数组</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a1</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>1, 2, 3, 4<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">a2</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">(</span>1.5, 2, 3<span style="color: #9564bf;">)</span>, <span style="color: #9564bf;">(</span>4, 5, 6<span style="color: #9564bf;">)</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">a3</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>1, 2<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>3, 4<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span>, dtype=<span style="color: #c397d8;">complex</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a1<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a2<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a3<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[1 2 3 4]
[[1.5 2.  3. ]
 [4.  5.  6. ]]
[[1.+0.j 2.+0.j]
 [3.+0.j 4.+0.j]]

</pre>
</div>
</div>
