python/python-lib-numpy.org
* 初始化数组
  Numpy 初始化数组一般是生成一定维度的列表，具体如下
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    np.zeros((3, 4))
    np.ones((2, 3, 4), dtype=np.int16)
    np.empty((2, 3))

    np.arange(10, 30, 5)  # samillar to range()
    np.arange(1, 2, 0.3)  # but accept float

    from numpy import pi
    np.linspace(0, 2, 9)
    x = np.linspace(0, 2 * pi, 10)
    y = np.sin(x)

    print(list(zip(x, y)))
  #+END_SRC

  #+RESULTS:
  : [(0.0, 0.0), (0.6981317007977318, 0.6427876096865393), (1.3962634015954636, 0.984807753012208), (2.0943951023931953, 0.8660254037844387), (2.792526803190927, 0.3420201433256689), (3.490658503988659, -0.34202014332566866), (4.1887902047863905, -0.8660254037844385), (4.886921905584122, -0.9848077530122081), (5.585053606381854, -0.6427876096865396), (6.283185307179586, -2.4492935982947064e-16)]

  随机生成数组，获取一些统计信息
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    a0 = np.random.random((2, 3))
    print(a0)
    print(a0.min(), a0.max())
    print(a0.sum())
    print(a0.mean())

    a1 = np.random.normal(0, 0.1, 10)  # mu, sigma, count
    print(a1[a1 > 0])
    print(a1.mean())
  #+END_SRC

  #+RESULTS:
  : [[0.9252851  0.7129627  0.40223125]
  :  [0.90696639 0.43173784 0.03253335]]
  : 0.0325333525900483 0.9252851004000952
  : 3.4117166388143234
  : 0.5686194398023873
  : [0.11057307 0.07345595 0.06929216 0.13555647]
  : -0.03848054532856991

  可以通过 Reshape 快速地修改 Python 数组的维度，这个方法非常有用
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    a1 = np.arange(12)
    print(a1)
    a2 = a1.reshape(4, 3)
    print(a2)
    print(a2.shape)
  #+END_SRC

  #+RESULTS:
  : [ 0  1  2  3  4  5  6  7  8  9 10 11]
  : [[ 0  1  2]
  :  [ 3  4  5]
  :  [ 6  7  8]
  :  [ 9 10 11]]
  : (4, 3)

  当给出数组的维度为 -1 时，代表需要自推导维度大小
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    a0 = np.arange(30)
    a0.shape = 2, -1, 3  # -1 means "whatever is needed"
    print(a0.shape)

    a1 = a0.reshape(-1, 10)
    print(a1.shape)
  #+END_SRC

  #+RESULTS:
  : (2, 5, 3)
  : (3, 10)

* 拼接数组
  可以使用 vstack 或者 hstack 来拼接数组，不过这样的效率比较低，一般建议直接初始
  化对应大小的数组，然后使用 reshape
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    a1 = np.arange(4).reshape((2, -1))
    a2 = a1 + 20

    a3 = np.vstack((a1, a2))
    print(a3)

    a4 = np.hstack((a1, a2))
    print(a4)
  #+END_SRC

  #+RESULTS:
  : [[ 0  1]
  :  [ 2  3]
  :  [20 21]
  :  [22 23]]
  : [[ 0  1 20 21]
  :  [ 2  3 22 23]]

