python/python-lib-numpy.html

<div id="outline-container-org18b8add" class="outline-2">
<h2 id="org18b8add"><span class="section-number-2">4</span> 初始化数组</h2>
<div class="outline-text-2" id="text-4">
<p>
Numpy 初始化数组一般是生成一定维度的列表，具体如下
</p>
<div class="org-src-container">
<pre class="src src-python">np.zeros<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>3, 4<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
np.ones<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>2, 3, 4<span style="color: #d8241f;">)</span>, dtype=np.int16<span style="color: #8d5649;">)</span>
np.empty<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>2, 3<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>

np.arange<span style="color: #8d5649;">(</span>10, 30, 5<span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">samillar to range()</span>
np.arange<span style="color: #8d5649;">(</span>1, 2, 0.3<span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">but accept float</span>

<span style="color: #b9ca4a;">from</span> numpy <span style="color: #b9ca4a;">import</span> pi
np.linspace<span style="color: #8d5649;">(</span>0, 2, 9<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">x</span> = np.linspace<span style="color: #8d5649;">(</span>0, 2 * pi, 10<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">y</span> = np.sin<span style="color: #8d5649;">(</span>x<span style="color: #8d5649;">)</span>

<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span><span style="color: #c397d8;">list</span><span style="color: #d8241f;">(</span><span style="color: #c397d8;">zip</span><span style="color: #9564bf;">(</span>x, y<span style="color: #9564bf;">)</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[(0.0, 0.0), (0.6981317007977318, 0.6427876096865393), (1.3962634015954636, 0.984807753012208), (2.0943951023931953, 0.8660254037844387), (2.792526803190927, 0.3420201433256689), (3.490658503988659, -0.34202014332566866), (4.1887902047863905, -0.8660254037844385), (4.886921905584122, -0.9848077530122081), (5.585053606381854, -0.6427876096865396), (6.283185307179586, -2.4492935982947064e-16)]

</pre>

<p>
随机生成数组，获取一些统计信息
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a0</span> = np.random.random<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>2, 3<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0.<span style="color: #c397d8;">min</span><span style="color: #d8241f;">()</span>, a0.<span style="color: #c397d8;">max</span><span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0.<span style="color: #c397d8;">sum</span><span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0.mean<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">a1</span> = np.random.normal<span style="color: #8d5649;">(</span>0, 0.1, 10<span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">mu, sigma, count</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a1<span style="color: #d8241f;">[</span>a1 &gt; 0<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a1.mean<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[[0.9252851  0.7129627  0.40223125]
 [0.90696639 0.43173784 0.03253335]]
0.0325333525900483 0.9252851004000952
3.4117166388143234
0.5686194398023873
[0.11057307 0.07345595 0.06929216 0.13555647]
-0.03848054532856991

</pre>

<p>
可以通过 Reshape 快速地修改 Python 数组的维度，这个方法非常有用
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a1</span> = np.arange<span style="color: #8d5649;">(</span>12<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a1<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">a2</span> = a1.reshape<span style="color: #8d5649;">(</span>4, 3<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a2<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a2.shape<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[ 0  1  2  3  4  5  6  7  8  9 10 11]
[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [ 9 10 11]]
(4, 3)

</pre>

<p>
当给出数组的维度为 -1 时，代表需要自推导维度大小
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a0</span> = np.arange<span style="color: #8d5649;">(</span>30<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">a0.shape</span> = 2, -1, 3  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">-1 means "whatever is needed"</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0.shape<span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">a1</span> = a0.reshape<span style="color: #8d5649;">(</span>-1, 10<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a1.shape<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
(2, 5, 3)
(3, 10)

</pre>
</div>
</div>

<div id="outline-container-org35d8d90" class="outline-2">
<h2 id="org35d8d90"><span class="section-number-2">5</span> 拼接数组</h2>
<div class="outline-text-2" id="text-5">
<p>
可以使用 vstack 或者 hstack 来拼接数组，不过这样的效率比较低，一般建议直接初始
化对应大小的数组，然后使用 reshape
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a1</span> = np.arange<span style="color: #8d5649;">(</span>4<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>2, -1<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">a2</span> = a1 + 20

<span style="color: #e7c547;">a3</span> = np.vstack<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>a1, a2<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a3<span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">a4</span> = np.hstack<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>a1, a2<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a4<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[[ 0  1]
 [ 2  3]
 [20 21]
 [22 23]]
[[ 0  1 20 21]
 [ 2  3 22 23]]

</pre>
</div>
</div>
