python/python-lib-numpy.org
* 基本运算和矩阵相关算法
  Numpy 重载了 Python 的数学操作符，基本操作如下
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    a = np.array([20, 30, 40, 50])
    b = np.arange(4)
    c = a - b
    print(b**2) # power
    10 * np.sin(a)
    print(a < 35)
  #+END_SRC

  #+RESULTS:
  : [0 1 4 9]
  : [ True  True False False]

  矩阵的乘法和矩阵里面每个元素相乘
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    A = np.array([[1,1], [0,1]] )
    B = np.array([[2,0], [3,4]] )
    print(A * B)        # elementwise product
    print(A @ B)        # matrix product
    print(A.dot(B))     # another matrix product
  #+END_SRC

  #+RESULTS:
  : [[2 0]
  :  [0 4]]
  : [[5 4]
  :  [3 4]]
  : [[5 4]
  :  [3 4]]

  基本线性代数的操作
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    a0 = np.array([[1.0, 2.0], [3.0, 4.0]])
    a1 = a0.T # same as a0.transpose()
    print(a1)

    a2 = np.linalg.inv(a0)
    print(a2)

    I = np.eye(2)
    J = np.array([[0.0, -1.0], [1.0, 0.0]])
    J2 = J @ J  # matrix product
    T0 = np.trace(I)  # trace
    y = np.array([[5.], [7.]])
    res1 = np.linalg.solve(a0, y)
    print(res1)
    res2 = np.linalg.eig(j)
    print(res2)
  #+END_SRC

  #+RESULTS:
  : [[1. 3.]
  :  [2. 4.]]
  : [[-2.   1. ]
  :  [ 1.5 -0.5]]
  : [[-3.]
  :  [ 4.]]
  : (array([0.69722436, 4.30277564]), array([[-0.60889368, -0.3983218 ],
  :        [ 0.79325185, -0.91724574]]))

* 深度复制 copy 方法
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    a0 = np.arange(6)
    b0 = a0.copy()        # a new array object with new data is created
    print(b0)
  #+END_SRC

  #+RESULTS:
  : [0 1 2 3 4 5]

* 索引
  Numpy 的索引是一个比较有用的操作，可以实现快速操作，防止进行使用速度比较慢的
  for 循环，同时也可以使代码读起来比较简洁
