python/python-lib-numpy.html

<div id="outline-container-org9b24287" class="outline-2">
<h2 id="org9b24287"><span class="section-number-2">6</span> 基本运算和矩阵相关算法</h2>
<div class="outline-text-2" id="text-6">
<p>
Numpy 重载了 Python 的数学操作符，基本操作如下
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>20, 30, 40, 50<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">b</span> = np.arange<span style="color: #8d5649;">(</span>4<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">c</span> = a - b
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>b**2<span style="color: #8d5649;">)</span> <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">power</span>
10 * np.sin<span style="color: #8d5649;">(</span>a<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a &lt; 35<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[0 1 4 9]
[ True  True False False]

</pre>

<p>
矩阵的乘法和矩阵里面每个元素相乘
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">A</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>1,1<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>0,1<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span> <span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">B</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>2,0<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>3,4<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span> <span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>A * B<span style="color: #8d5649;">)</span>        <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">elementwise product</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>A @ B<span style="color: #8d5649;">)</span>        <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">matrix product</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>A.dot<span style="color: #d8241f;">(</span>B<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>     <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">another matrix product</span>
</pre>
</div>

<pre class="example">
[[2 0]
 [0 4]]
[[5 4]
 [3 4]]
[[5 4]
 [3 4]]

</pre>

<p>
基本线性代数的操作
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a0</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>1.0, 2.0<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>3.0, 4.0<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">a1</span> = a0.T <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">same as a0.transpose()</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a1<span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">a2</span> = np.linalg.inv<span style="color: #8d5649;">(</span>a0<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a2<span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">I</span> = np.eye<span style="color: #8d5649;">(</span>2<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">J</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>0.0, -1.0<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>1.0, 0.0<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">J2</span> = J @ J  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">matrix product</span>
<span style="color: #e7c547;">T0</span> = np.trace<span style="color: #8d5649;">(</span>I<span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">trace</span>
<span style="color: #e7c547;">y</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>5.<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>7.<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">res1</span> = np.linalg.solve<span style="color: #8d5649;">(</span>a0, y<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>res1<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">res2</span> = np.linalg.eig<span style="color: #8d5649;">(</span>j<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>res2<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[[1. 3.]
 [2. 4.]]
[[-2.   1. ]
 [ 1.5 -0.5]]
[[-3.]
 [ 4.]]
(array([0.69722436, 4.30277564]), array([[-0.60889368, -0.3983218 ],
       [ 0.79325185, -0.91724574]]))

</pre>
</div>
</div>

<div id="outline-container-org99e75c6" class="outline-2">
<h2 id="org99e75c6"><span class="section-number-2">7</span> 深度复制 copy 方法</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a0</span> = np.arange<span style="color: #8d5649;">(</span>6<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">b0</span> = a0.copy<span style="color: #8d5649;">()</span>        <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">a new array object with new data is created</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>b0<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[0 1 2 3 4 5]

</pre>
</div>
</div>

<div id="outline-container-org05e03cb" class="outline-2">
<h2 id="org05e03cb"><span class="section-number-2">8</span> 索引</h2>
<div class="outline-text-2" id="text-8">
<p>
Numpy 的索引是一个比较有用的操作，可以实现快速操作，防止进行使用速度比较慢的
for 循环，同时也可以使代码读起来比较简洁
</p>
</div>
