python/python-lib-numpy.org
** 使用 Indices 索引
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     a0 = np.arange(12)**2  # the first 12 square numbers
     print(a0)
     print(a[2])  # the elements of a at the positions i

     b0 = np.array([1, 1, 3, 8, 5])  # an array of indices
     print(a0[b0]) # get elements with indices as b0
   #+END_SRC

   #+RESULTS:
   : [  0   1   4   9  16  25  36  49  64  81 100 121]
   : 40
   : [ 1  1  9 64 25]

   在实际工程可以使用下标索引来掩码 (mask)，挑选出对应的色块
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     palette = np.array([
         [0, 0, 0],  # black
         [255, 0, 0],  # red
         [0, 255, 0],  # green
         [0, 0, 255],  # blue
         [255, 255, 255]  # white
     ])
     image = np.array([
         [0, 1, 2, 0],  # each value corresponds to a color in the palette
         [0, 3, 4, 0]
     ])
     res = palette[image]  # the (2,4,3) color image
     print(res)
   #+END_SRC

   #+RESULTS:
   : [[[  0   0   0]
   :   [255   0   0]
   :   [  0 255   0]
   :   [  0   0   0]]
   :
   :  [[  0   0   0]
   :   [  0   0 255]
   :   [255 255 255]
   :   [  0   0   0]]]

   #+BEGIN_SRC python :session cpython :exports both :results output pp
     a0 = np.arange(12).reshape(3, 4)
     i = np.array([[0, 1], [1, 2]])  # indices for the first dim of a
     j = np.array([[2, 1], [3, 3]])  # indices for the second dim
     print(a0)

     a1 = a0[i, j]  # i and j must have equal shape
     print(a1)

     b1 = a0[i, 2]
     print(b1)

     b2 = a0[:, j]  # i.e., a[ : , j]
     print(b2)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   [[ 0  1  2  3]
    [ 4  5  6  7]
    [ 8  9 10 11]]
   [[ 2  5]
    [ 7 11]]
   [[ 2  6]
    [ 6 10]]
   [[[ 2  1]
     [ 3  3]]

    [[ 6  5]
     [ 7  7]]

    [[10  9]
     [11 11]]]
   #+end_example

** 使用布尔值索引
   Numpy 支持使用条件
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     a0 = np.arange(6).reshape(3, 2)
     b0 = a0 > 4
     print(b0)
     print(a0[b0])  # 1d array with the selected elements

     a0[b0] = 0  # All elements of 'a' higher than 4 become 0
     print(a0)
   #+END_SRC

   #+RESULTS:
   : [[False False]
   :  [False False]
   :  [False  True]]
   : [5]
   : [[0 1]
   :  [2 3]
   :  [4 0]]

   多维度的索引
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     a0 = np.arange(10).reshape(2, -1)
     print(a0)
     b1 = np.array([False, True])  # first dim selection
     b2 = np.array([True, False, True, False, False])  # second dim selection
     print(a0[b1, :])  # selecting rows
     a0[b1]  # same thing
     a0[:, b2]  # selecting columns
     print(a0[b1, b2])  # a weird thing to do
   #+END_SRC

   #+RESULTS:
   : [[0 1 2 3 4]
   :  [5 6 7 8 9]]
   : [[5 6 7 8 9]]
   : [5 7]

