python/python-lib-numpy.html
<div id="outline-container-orgf5b6ee8" class="outline-3">
<h3 id="orgf5b6ee8"><span class="section-number-3">8.1</span> 使用 Indices 索引</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a0</span> = np.arange<span style="color: #8d5649;">(</span>12<span style="color: #8d5649;">)</span>**2  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">the first 12 square numbers</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a<span style="color: #d8241f;">[</span>2<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">the elements of a at the positions i</span>

<span style="color: #e7c547;">b0</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>1, 1, 3, 8, 5<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">an array of indices</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0<span style="color: #d8241f;">[</span>b0<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span> <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">get elements with indices as b0</span>
</pre>
</div>

<pre class="example">
[  0   1   4   9  16  25  36  49  64  81 100 121]
40
[ 1  1  9 64 25]

</pre>

<p>
在实际工程可以使用下标索引来掩码 (mask)，挑选出对应的色块
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">palette</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>
    <span style="color: #9564bf;">[</span>0, 0, 0<span style="color: #9564bf;">]</span>,  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">black</span>
    <span style="color: #9564bf;">[</span>255, 0, 0<span style="color: #9564bf;">]</span>,  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">red</span>
    <span style="color: #9564bf;">[</span>0, 255, 0<span style="color: #9564bf;">]</span>,  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">green</span>
    <span style="color: #9564bf;">[</span>0, 0, 255<span style="color: #9564bf;">]</span>,  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">blue</span>
    <span style="color: #9564bf;">[</span>255, 255, 255<span style="color: #9564bf;">]</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">white</span>
<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">image</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>
    <span style="color: #9564bf;">[</span>0, 1, 2, 0<span style="color: #9564bf;">]</span>,  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">each value corresponds to a color in the palette</span>
    <span style="color: #9564bf;">[</span>0, 3, 4, 0<span style="color: #9564bf;">]</span>
<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">res</span> = palette<span style="color: #8d5649;">[</span>image<span style="color: #8d5649;">]</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">the (2,4,3) color image</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>res<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[[[  0   0   0]
  [255   0   0]
  [  0 255   0]
  [  0   0   0]]

 [[  0   0   0]
  [  0   0 255]
  [255 255 255]
  [  0   0   0]]]

</pre>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a0</span> = np.arange<span style="color: #8d5649;">(</span>12<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span>3, 4<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">i</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>0, 1<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>1, 2<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">indices for the first dim of a</span>
<span style="color: #e7c547;">j</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>2, 1<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>3, 3<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">indices for the second dim</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0<span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">a1</span> = a0<span style="color: #8d5649;">[</span>i, j<span style="color: #8d5649;">]</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">i and j must have equal shape</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a1<span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">b1</span> = a0<span style="color: #8d5649;">[</span>i, 2<span style="color: #8d5649;">]</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>b1<span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">b2</span> = a0<span style="color: #8d5649;">[</span>:, j<span style="color: #8d5649;">]</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">i.e., a[ : , j]</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>b2<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]
[[ 2  5]
 [ 7 11]]
[[ 2  6]
 [ 6 10]]
[[[ 2  1]
  [ 3  3]]

 [[ 6  5]
  [ 7  7]]

 [[10  9]
  [11 11]]]
</pre>
</div>
</div>

<div id="outline-container-org3d1e6e0" class="outline-3">
<h3 id="org3d1e6e0"><span class="section-number-3">8.2</span> 使用布尔值索引</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Numpy 支持使用条件
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a0</span> = np.arange<span style="color: #8d5649;">(</span>6<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span>3, 2<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">b0</span> = a0 &gt; 4
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>b0<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0<span style="color: #d8241f;">[</span>b0<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">1d array with the selected elements</span>

<span style="color: #e7c547;">a0</span><span style="color: #8d5649;">[</span>b0<span style="color: #8d5649;">]</span> = 0  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">All elements of 'a' higher than 4 become 0</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[[False False]
 [False False]
 [False  True]]
[5]
[[0 1]
 [2 3]
 [4 0]]

</pre>

<p>
多维度的索引
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a0</span> = np.arange<span style="color: #8d5649;">(</span>10<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span>2, -1<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">b1</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #7aa6da;">False</span>, <span style="color: #7aa6da;">True</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">first dim selection</span>
<span style="color: #e7c547;">b2</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #7aa6da;">True</span>, <span style="color: #7aa6da;">False</span>, <span style="color: #7aa6da;">True</span>, <span style="color: #7aa6da;">False</span>, <span style="color: #7aa6da;">False</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">second dim selection</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0<span style="color: #d8241f;">[</span>b1, :<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">selecting rows</span>
a0<span style="color: #8d5649;">[</span>b1<span style="color: #8d5649;">]</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">same thing</span>
a0<span style="color: #8d5649;">[</span>:, b2<span style="color: #8d5649;">]</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">selecting columns</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a0<span style="color: #d8241f;">[</span>b1, b2<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">a weird thing to do</span>
</pre>
</div>

<pre class="example">
[[0 1 2 3 4]
 [5 6 7 8 9]]
[[5 6 7 8 9]]
[5 7]

</pre>
</div>
</div>
</div>
